{"input": "Query: dainty silver flower ring\n- Concepts in this query: not available\n\nProduct:\n- Title: Flower ring | .925 sterling silver | nature-inspired jewelry | minimalistic stacking ring | wedding jewelry | gift for her\n- Shop: 6daycreations2\n- Image: A hand wearing silver ring with a flower design and a thin band\n- Description: lovely, ring, feature, branch, finger, small, flower, perfect, lovely ring, ring feature, s finger, small flower", "output": "relevant"}
{"input": "Query: personalized baby blanket\n- Concepts in this query: tangibleItem:baby blanket;customization:personalized;\n\nProduct:\n- Title: Personalized Baby Blanket, Soft Cotton Knit Baby Blanket, Custom Baby Name Blanket, Baby Shower Gift,Newborn Blanket, Keepsake Gift for Baby\n- Shop: BabyShop77\n- Image: A sage green knitted baby blanket with the name \"Oliver Henry\" embroidered in white. The text \"Ships Next Business Day\" is also visible in the image.\n- Description: baby, gift, blanket, personalize, soft, cotton, knit, shower, name, ba, baby gift, gift baby, baby blanket, blanket personalize, personalize baby, soft cotton, cotton knit, knit baby, blanket baby, baby shower, shower gift, baby name, name blanket, gift personalize", "output": "relevant"}
{"input": "Query: 70s pants sewing pattern\n- Concepts in this query: not available\n\nProduct:\n- Title: Lenox Pajamas - PDF Sewing Pattern - Pajama Pants Pattern - Easy Pajama Pattern for Women + Teens - Sizes 0-18\n- Shop: StudioMSquared\n- Image: A person wearing a gray tank top and blue and white floral print pajama pants. The person is standing on a white bed with a blue pillow.\n- Description: pdf, sewing, pattern, finish, product, full, description, purchase, new, favorite, pair, comfy, lounge, pdf sewing, sewing pattern, finish product, product please, full description, new favorite, favorite pair, comfy lounge", "output": "partial"}
{"input": "Query: 70s pants sewing pattern\n- Concepts in this query: not available\n\nProduct:\n- Title: Party! Disco Ball Hand Embroidery Pattern - PDF PATTERN ONLY\n- Shop: CristinMorganThread\n- Image: Embroidered disco ball pattern with embroidery floss in various colors including pink, orange, red, blue, and green. The embroidery hoop is on a white surface with glitter. The text \"PDF PATTERN ONLY!\" is in a black circle.\n- Description: party, time, own, sparkly, disco, ball, hoop, pdf, pattern, perfect, gift, collection, home, deco, party time, own sparkly, sparkly disco, disco ball, ball hoop, pdf pattern, pattern perfect, own collection, home deco", "output": "partial"}
{"input": "Query: mid century modern furniture\n- Concepts in this query: tangibleItem:furniture;style:mid century modern;\n\nProduct:\n- Title: Same Hour Reading/Same Day Psychic Reading Psychic Predictions, General Reading, Psychic Reading, Spiritual Reading, Blind Intuitive Reading\n- Shop: TheMotherMoonCoven\n- Image: not available\n- Description: same, hour, day, blind, reading, psychic, prediction, general, desti, same hour, same day, blind reading, psychic prediction, psychic reading, reading general, general reading", "output": "not_relevant"}
{"input": "Query: advent calendars\n- Concepts in this query: tangibleItem:calendars;\n\nProduct:\n- Title: Charlie's Homemade Smoked Beef Jerky Bites  FREE  SHIPPING\n- Shop: CharliesWSBJ\n- Image: A close-up of a plate of small, dark red, meaty cubes. The cubes are arranged in a random pattern and appear to be cooked and glazed. The cubes are on a white paper towel.\n- Description: order, receive, business, day, ho, order receive, business day", "output": "not_relevant"}
{"input": "Query: jigglypuff\n- Concepts in this query: fandom:jigglypuff;\n\nProduct:\n- Title: Snorlax Watch Charger Base\n- Shop: not available\n- Image: not available\n- Description: not available", "output": "partial"}
{"input": "Query: derrick white\n- Concepts in this query: fandom:derrick white;\n\nProduct:\n- Title: Greatest Celtics Plays: Leatherette Coasters (Set of 4)\n- Shop: PlaybookProducts\n- Image: not available\n- Description: relive, great, moment, celtic, basketball, history, set, laser, etch, coaster, historic, play, great moment, celtic basketball, basketball history, laser etch, etch coaster, historic play", "output": "partial"}
{"input": "Query: swiftie\n- Concepts in this query: fandom:swiftie;\n\nProduct:\n- Title: All Too Well Shirt\n- Shop: SweatShirtUSCO\n- Image: A beige t-shirt with the lyrics to the song \"All Too Well\" printed in red on the front. The lyrics are in a small font and are arranged in a vertical column. The lyrics include the lines \"I walked through the door with you, The air was cold, but something about you made me feel like I was home again\" and \"You call me up again just to break me like a promise, so casually cruel in the name of being honest.\" \n- Description: \"\"", "output": "relevant"}
{"input": "Query: bag of holding\n- Concepts in this query: tangibleItem:bag;fandom:bag of holding;\n\nProduct:\n- Title: Mystery Dice Blind Bags! Over 70 styles available! DND Dice Tabletop\n- Shop: GamemastersGuildLLC\n- Image: Three silver holographic bags with the text \"Gamemasters Guild\" printed on them. The bags are surrounded by a variety of colorful dice with different numbers and symbols printed on them.\n- Description: mystery, blind, bag, perfect, look, something, new, over, style, di, mystery blind, blind bag, bag perfect, something new, over style", "output": "partial"}
{"input": "Query: gilmore girls\n- Concepts in this query: fandom:gilmore girls;\n\nProduct:\n- Title: Luke's Watercolor Painting Unframed Matte Poster Art Print\n- Shop: GreetingsFromTherapy\n- Image: A framed watercolor painting of a street scene with a yellow sign that reads \"Luke's\" hanging above a storefront. The street is lined with trees and the buildings are painted in muted tones of yellow and brown.\n- Description: nostalgic, watercolor, painting, use, digital, illustration, print, thick, matte, poster, paper, perfect, gift, nostalgic watercolor, watercolor painting, use digital, digital illustration, thick matte, matte poster, poster paper, perfect gift", "output": "relevant"}
{"input": "Query: shagaf vanilla toffee\n- Concepts in this query: not available\n\nProduct:\n- Title: Bronze and Blaze Perfume -  Bronze amber, cognac barrels, red oak leaf, Perique tobacco, Opoponax, Soft suede, Creamy steamy vanilla coffee\n- Shop: Alkemia\n- Image: A painting of a woman with dark hair and a red dress. She is holding a bouquet of flowers in her hand. The background is a gold and red color.\n- Description: autumnal, bronze, amber, age, cognac, barrel, stave, red, oak, leave, perique, pipe, tobacco, raw, wool, ripe, pumpkin, opoponax, sweet, myrrh, soft, autumnal bronze, bronze amber, amber age", "output": "partial"}
{"input": "Query: caitlynminimalist\n- Concepts in this query: fandom:caitlynminimalist;\n\nProduct:\n- Title: Personalized Name Necklace by CaitlynMinimalist • Gold Name Necklace with Box Chain • Perfect Gift for Her • Personalized Gift • NM81F91\n- Shop: CaitlynMinimalist\n- Image: A gold chain necklace with a cursive nameplate that reads \"Blakely\".\n- Description: b, c, m, e, k, l, delicate, soft, name, necklace, box, chain, lovely, adornment, x c, i n, m e, e n, n e, e c, c k, k l, c e, name necklace", "output": "relevant"}
{"input": "Query: caitlynminimalist\n- Concepts in this query: fandom:caitlynminimalist;\n\nProduct:\n- Title: Name Necklace Gold, Nameplate Necklace 14k Solid Gold, Custom Name Jewelry, Gold Filled Name, Mama Necklace, Personalized Name Jewelry, AU20\n- Shop: Funufco\n- Image: not available\n- Description: perfect, personal, addition, wardrobe, beautiful, name, necklace, k, solid, gold, elegant, timeless, way, perfect personal, personal addition, beautiful name, name necklace, k solid, solid gold, timeless way", "output": "partial"}
{"input": "Query: velari jewelry ring\n- Concepts in this query: not available\n\nProduct:\n- Title: Stainless Steel Fidget Spinning Ring | Anxiety Relief | Stress Relief Tool\n- Shop: RylynHarper\n- Image: Four different colored rings with a textured edge. The rings are silver, black, rose gold, and iridescent green.\n- Description: anxiety, stress, day, fidget, spin, ring, sleek, design, accessory, fidget spin, spin ring, sleek design", "output": "partial"}
{"input": "Query: velari jewelry ring\n- Concepts in this query: not available\n\nProduct:\n- Title: Custom Neon Sign , Neon Signs , Neon sign bedroom , LED Neon Sign , Wedding sign , Neon light Sign, Home Decor , Wall Decor , Valentines day\n- Shop: ManhattanNeons\n- Image: A neon blue sign that says \"Luna\".\n- Description: not available", "output": "not_relevant"}
{"input": "Query: rooster coffee mug\n- Concepts in this query: tangibleItem:coffee mug;motif:rooster;\n\nProduct:\n- Title: Backyard Chickens, Tea Towel\n- Shop: PartyOnPaperCo\n- Image: not available\n- Description: _x0000_twill machine, towel, cold, educational, tea towel, wash, educational tea, machine wash, ch tea, cold water, cotton, backyard, ch, water, tea, cotton twill, twill, kitchen, machine, kitchen ch_x0000_", "output": "partial"}
{"input": "Query: xxxl red dress\n- Concepts in this query: not available\n\nProduct:\n- Title: Linen dress, Womens Red Pleated Midi Linen Dress, Spring Long Linen Dress, Boat Neck Swing Linen Dress with Pockets, Handmade dress 3423#\n- Shop: xiaolizi\n- Image: A long-sleeved, red midi dress with a gathered skirt and a scoop neckline.\n- Description: thanks, briesoldo, wear, xiaoliz, red, linen, dress, midi, craft, soft, cotton, darker, shape, hue, featur, briesoldo wear, wear xiaoliz, red linen, linen dress, red midi, midi dress, dress craft, soft cotton, cotton linen", "output": "relevant"}
{"input": "Query: handbag\n- Concepts in this query: tangibleItem:handbag;\n\nProduct:\n- Title: 10 PNG Floral Handbag Clipart, Floral Purse, Floral Clutch, Digital Clipart, Printable Watercolor clipart, Digital download, Paper crafts\n- Shop: NightingaleCraftery\n- Image: A white leather handbag with a pink handle and strap. The bag is decorated with pink flowers and green leaves. The bag has a gold lock and keyhole.\n- Description: irresistible, worth, clipart, collection, image, good, value, money, bundle, variety, irresistible worth, clipart collection, good value, money clipart, clipart bundle", "output": "partial"}
{"input": "Query: william and mary style furniture\n- Concepts in this query: not available\n\nProduct:\n- Title: William & Mary University SVG, Tribe SVG, College, Athletics, Football, Ready For Cricut, Instant Download.\n- Shop: AyfesGift\n- Image: not available\n- Description: ayfesgift, digital, file, bundle, svg, png, pdf, project, digital file, svg png, png pdf", "output": "not_relevant"}
