{"input": "Query: dainty silver flower ring\n- Possible rewrites for this query: unknown\n- Concepts in this query: unknown\n\nProduct:\n- Title: Flower ring | .925 sterling silver | nature-inspired jewelry | minimalistic stacking ring | wedding jewelry | gift for her\n- Shop name: 6daycreations2\n- Product image caption: A hand wearing silver ring with a flower design and a thin band\n- Unigrams & bigrams from description: lovely, ring, feature, branch, finger, small, flower, perfect, lovely ring, ring feature, s finger, small flower\n- Category: jewelry.rings.statement_rings\n- Attributes: material multi:silver;primary color:silver;band color:silver\n- Tags: flower floral ring, jewelry women girls, forget me not petal, grandma aunt sister, mom mama mum mother, christmas present, birthday daughter 20, girlfriend wife gift, accessory band stud, nature branch vine, minimalistic midi, hypoallergenic boho, sterling silver tiny\n- Custom options: Ring size: 6, 8, 10, 7, 9\n- Reviews: unknown\n", "output": "{\"label\": \"relevant\", \"reason\": \"Query requested product type is ring. Query requested product features include: dainty style, silver color and or material, flower motif. Product is ring. For dainty, title includes minimalist and image caption mentioning thin band confirms that product is dainty. For silver, product attributes match both material and color silver. For flower motif, title, tags, and description confirms that product has flower motif. Product type match, and all product features match, therefore label is relevant.\"}"}
{"input": "Query: personalized baby blanket\n- Possible rewrites for this query: baby name blanket, baby blanket personalized, baby blanket with name, monogrammed baby blanket, personalized minky baby blanket, custom baby blanket with name\n- Concepts in this query: tangibleItem:baby blanket;customization:personalized;\n\nProduct:\n- Title: Personalized Baby Blanket, Soft Cotton Knit Baby Blanket, Custom Baby Name Blanket, Baby Shower Gift,Newborn Blanket, Keepsake Gift for Baby\n- Shop name: BabyShop77\n- Product image caption: A sage green knitted baby blanket with the name \"Oliver Henry\" embroidered in white. The text \"Ships Next Business Day\" is also visible in the image.\n- Unigrams & bigrams from description: baby, gift, blanket, personalize, soft, cotton, knit, shower, name, ba, baby gift, gift baby, baby blanket, blanket personalize, personalize baby, soft cotton, cotton knit, knit baby, blanket baby, baby shower, shower gift, baby name, name blanket, gift personalize\n- Category: home_and_living.bedding.blankets_and_throws.baby_blankets\n- Attributes: fabric technique:embroidered;occasion:baby shower;material multi:cotton;holiday:valentine's day\n- Tags: Baby Blanket, Baby Gift, Blanket with name, Embroidered Blankets, Custom Baby name, Custom blanket, Custom Blanket baby, Newborn gift, baby shower gift, custom name blanket, personalized blanket, baby girl blanket, baby boy blanket\n- Custom options: Personalization: 2 Names (2 words), 1 Name  (1 word), NO EMBROIDERY; Blanket Color: Grey, Navy, Lilac, Cream (not white), Baby Blue, Dusty Pink, Grape, Sage green, Mustard, Khaki\n- Reviews: great quality!! very beautiful!! I will purchase again | So cute and soft! Great gift | Sweet little blanket for a new baby | Item as described! Such a great gift | This is a beautiful personalized baby blanket\n", "output": "{\"label\": \"relevant\", \"reason\": \"Query requested product type is blanket. Query requested product features include: for babies, personalizable. Product is blanket. With regard to for babies, title and image caption confirm that product is for babies. For feature personalizable, title and custom options confirm that product is personalizable. Product type match, and both product features match, therefore label is relevant.\"}"}
{"input": "Query: 70s pants sewing pattern\n- Possible rewrites for this query: unknown\n- Concepts in this query: unknown\n\nProduct:\n- Title: Lenox Pajamas - PDF Sewing Pattern - Pajama Pants Pattern - Easy Pajama Pattern for Women + Teens - Sizes 0-18\n- Shop name: StudioMSquared\n- Product image caption: A person wearing a gray tank top and blue and white floral print pajama pants. The person is standing on a white bed with a blue pillow.\n- Unigrams & bigrams from description: pdf, sewing, pattern, finish, product, full, description, purchase, new, favorite, pair, comfy, lounge, pdf sewing, sewing pattern, finish product, product please, full description, new favorite, favorite pair, comfy lounge\n- Category: craft_supplies_and_tools.patterns_and_how_to.patterns_and_blueprints\n- Attributes: craft type:sewing\n- Tags: sewing pattern, for women, for teens, pajama pants, pajama shorts, pyjamas, jammies, pj sewing pattern, pajamas for women, women pajamas, beginner pjs, beginner pajamas, pajamas\n- Custom options: unknown\n- Reviews: Haven't made a pair yet but I have read through the instructions and they are clear and concise.  Can't see where anything could go wrong. :-) | Can't wait to start sewing | So far I am mostly happy with the pattern.  It printed a little larger (based on the 1in test square) but the sizing still seemed a little off.  I measured hips, cut according to the guide as a size 10 which was huge!!!  I recut as a size 6 and it was still big.  Finally cut it as a size 2 and am happy.  The pockets are shallower than i would like so the next pair I will use a different pattern for the pockets. | Nice pattern to use - so cute! | This pattern is super easy to follow with minimal pieces. I can't wait to sew up my fabric!\n", "output": "{\"label\": \"partial\", \"reason\": \"Query requested product type is sewing pattern. Query requested product features include: pattern for pants, 70s style. Product is sewing pattern. With regard to pattern for pants, title, tags, and description confirm that the pattern is for pajama pants which is a specific type of pants. With regard to 70s, description mentioning that this is for every-day comfy lounge wear suggesting that it is not in 70s style. Product type match, but not all features match, therefore label is partial. \"}"}
{"input": "Query: 70s pants sewing pattern\n- Possible rewrites for this query: unknown\n- Concepts in this query: unknown\n\nProduct:\n- Title: Party! Disco Ball Hand Embroidery Pattern - PDF PATTERN ONLY\n- Shop name: CristinMorganThread\n- Product image caption: Embroidered disco ball pattern with embroidery floss in various colors including pink, orange, red, blue, and green. The embroidery hoop is on a white surface with glitter. The text \"PDF PATTERN ONLY!\" is in a black circle.\n- Unigrams & bigrams from description: party, time, own, sparkly, disco, ball, hoop, pdf, pattern, perfect, gift, collection, home, deco, party time, own sparkly, sparkly disco, disco ball, ball hoop, pdf pattern, pattern perfect, own collection, home deco\n- Category: craft_supplies_and_tools.patterns_and_how_to.patterns_and_blueprints\n- Attributes: craft type:embroidery;craft type:needlepoint;craft type:crewel\n- Tags: pink, rainbow, colorful, disco, party, holiday, new years, new year's, beginner, craft, gift\n- Custom options: unknown\n- Reviews: This looks like a fairly straightforward pattern. I switched up some colors so we will see! | I was eyeing this pattern and had it in my favorites for weeks before purchasing. Hands down best disco pattern I have seen. It was a labor of love and she will hang proudly on my wall. I added some sequins for extra drama 🤣 | Awesome pattern! The instructions and advice are very thorough and clear, and I am grateful for that ahahaha | The transfer was easy. The instructions and information provided were great. | I haven't started to stitch this yet, but the pattern and instructions look great\n", "output": "{\"label\": \"partial\", \"reason\": \"Query requested product type is sewing pattern. Query requested product features include: pattern for pants, 70s style. Product is hand embroidery pattern. With regard to pattern for pants, product is not a pattern for pants because it is a pattern for disco ball. With regard to 70s, disco balls are characteristic of the disco era in the 1970s, so product matches with this part of the query. Product type does not match, but one of the features thematically match, therefore label is partial. \"}"}
{"input": "Query: mid century modern furniture\n- Possible rewrites for this query: furniture mid century modern, modern mid century furniture, mid century modern sofas, mid century modern furniture set, mid century modern decor furniture\n- Concepts in this query: tangibleItem:furniture;style:mid century modern;\n\nProduct:\n- Title: Same Hour Reading/Same Day Psychic Reading Psychic Predictions, General Reading, Psychic Reading, Spiritual Reading, Blind Intuitive Reading\n- Shop name: TheMotherMoonCoven\n- Product image caption: unknown\n- Unigrams & bigrams from description: same, hour, day, blind, reading, psychic, prediction, general, desti, same hour, same day, blind reading, psychic prediction, psychic reading, reading general, general reading\n- Category: home_and_living.spirituality_and_religion.psychic_readings\n- Attributes: unknown\n- Tags: same hour reading, same hour, psychic reading, spiritual reading, psychic medium, general reading, psychic, angel reading, same day reading, blind reading, intuitive reading, fortune teller, spirit guide reading\n- Custom options: unknown\n- Reviews: Very poetic.  In line with that I been feeling. | Thank you for the readings! I knew I needed to work on myself, but this is in so much detail and depth. Hard truths are what I needed . Thank you so much  again! | This was so beautiful, thank you ladies! | I love these wise women. Blessings\n", "output": "{\"label\": \"not_relevant\", \"reason\": \"Query requested product type is furniture. Query requested product features include: mid century modern style. Product is psychic reading. Product is not a furniture, and it has nothing to do with the mid century modern style under the context of furniture. Product type does not match, and none of the features match, therefore label is not_relevant. \"}"}
{"input": "Query: advent calendars\n- Possible rewrites for this query: mini advent calendars, 2024 advent calendars, yearly advent calendars, advent calendar, christmas advent calendars\n- Concepts in this query: tangibleItem:calendars;\n\nProduct:\n- Title: Charlie's Homemade Smoked Beef Jerky Bites  FREE  SHIPPING\n- Shop name: CharliesWSBJ\n- Product image caption: A close-up of a plate of small, dark red, meaty cubes. The cubes are arranged in a random pattern and appear to be cooked and glazed. The cubes are on a white paper towel.\n- Unigrams & bigrams from description: order, receive, business, day, ho, order receive, business day\n- Category: home_and_living.food_and_drink.snacks\n- Attributes: unknown\n- Tags: unknown\n- Custom options: Flavor: Mesquite, Cajun Lime, Lemon Pepper, Lightly Spicy, McHeat, HOT Teriyaki Pepper, Cracked Black Pepper, OF Smoked Salt Cure, Teriyaki Pepper, Sweet Garlic Pepper, HOT Sweet Garlic Pep; Weight: 8, 48, 80, 16, 4\n- Reviews: Arrived on time, delicious, and as described - thank you! | I like this teriyaki pepper flavor, it's great. But I got two different sample flavors to try with my order: \"McHeat\" & \"Sweet & Spicy\" and I liked those two flavors much more! I would STILL recommend this seller 100% | Wonderful product and very tasty!  And, got a little gift of teriyaki jerky which was delicious!  Thank you so much!  I'm gifting some to a friend and she will love it.  ;) | I tough it was goat meat. Just not a fan | The best in the world!\n", "output": "{\"label\": \"not_relevant\", \"reason\": \"Query requested product type is advent calendars. Query does not request any specific feature around the product. Product is beef jerky. Product is not advent calendars. Product type does not match, and none of the features match, therefore label is not_relevant. \"}"}
{"input": "Query: jigglypuff\n- Possible rewrites for this query: gyothy gumball billiard jigglypuff, jigglypuff figurine, puri jigglypuff, jigglypuff plushie, jiggly puff, jigglypuff jar, jigglypuff plush\n- Concepts in this query: fandom:jigglypuff;\n\nProduct:\n- Title: Snorlax Watch Charger Base\n- Shop name: unknown\n- Product image caption: unknown\n- Unigrams & bigrams from description: unknown\n- Category: unknown\n- Attributes: unknown\n- Tags: unknown\n- Custom options: unknown\n- Reviews: unknown\n", "output": "{\"label\": \"partial\", \"reason\": \"Query does not specify any specific product type. Query requested product features include: related to jigglypuff, which is a kind of pokemon. Product is a watch charger base. Feature wise, title confirms that product has a snorlax design, which is also a kind of pokemon. While product does not match the query, it is related to the pokemon theme of the query, therefore label is partial. \"}"}
{"input": "Query: derrick white\n- Possible rewrites for this query: derrick white gift, derrick white wall art, derrick white art, derrick white gifts\n- Concepts in this query: fandom:derrick white;\n\nProduct:\n- Title: Greatest Celtics Plays: Leatherette Coasters (Set of 4)\n- Shop name: PlaybookProducts\n- Product image caption: unknown\n- Unigrams & bigrams from description: relive, great, moment, celtic, basketball, history, set, laser, etch, coaster, historic, play, great moment, celtic basketball, basketball history, laser etch, etch coaster, historic play\n- Category: home_and_living.kitchen_and_dining.drink_and_barware.drinkware.coasters\n- Attributes: primary color:black;secondary color:white\n- Tags: Boston Celtics, Boston, Celtics, Celtics Gifts, gifts for, gift ideas for, father him dad son, boyfriend husband, unique cool gift men, sports fans, chirstmas gifts, art home decor, coaster set\n- Custom options: unknown\n- Reviews: The quality of the item matched the description. Very happy with my purchase | Highly quality. Exactly what I was expecting. | Great for a gift! He loved it! | Item was as expected and fun for occasion. Arrived after original stated delivery date so I had to ship. | Love these coasters and can't wait to gift them to a Huge Celtics fan-I'm sure he's going to love them as well. Very unique and well made. Would definitely recommend to any big sports fans!\n", "output": "{\"label\": \"partial\", \"reason\": \"Query does not specify any specific product type. Query requested product features include: related to derrick white, who is a basketball player for the Boston Celtics. Product is a set of 4 coasters. Feature wise, description confirms that product has design related to Celtics basketball. While product does not match the query, it is related to the Celtics basketball theme of the query, therefore label is partial. \"}"}
{"input": "Query: swiftie\n- Possible rewrites for this query: swiftie gifts for him, swiftie gifts, fifty swifties gifts, fifth wing swifties, swiftie hoodie\n- Concepts in this query: fandom:swiftie;\n\nProduct:\n- Title: All Too Well Shirt\n- Shop name: SweatShirtUSCO\n- Product image caption: A beige t-shirt with the lyrics to the song \"All Too Well\" printed in red on the front. The lyrics are in a small font and are arranged in a vertical column. The lyrics include the lines \"I walked through the door with you, The air was cold, but something about you made me feel like I was home again\" and \"You call me up again just to break me like a promise, so casually cruel in the name of being honest.\" \n- Unigrams & bigrams from description: \"\"\n- Category: clothing.gender_neutral_adult_clothing.tops_and_tees.tshirts\n- Attributes: sleeve length:short sleeve;holiday:mother's day;neckline:crew\n- Tags: mom Tank Top, women Tank Top, all too well, mom life, shirt for women, gift for mom, cute mom, mom lover, mama shirt, funny mama, best mama, best mama ever, gift for mother\n- Custom options: Size: Racerback Tank-XS, Racerback Tank-M, Racerback Tank-2XL, Unisex-Shirt-M, Unisex-Shirt-S, Unisex-Shirt-3XL, Unisex-Shirt-2XL, Racerback Tank-XL, Unisex-Shirt-L, Racerback Tank-L, Racerback Tank-S, Unisex-Shirt-XL; Color: Sand, Mint Green, Light Blue, Sky, Gold, White, Sport Grey, Natural, Kiwi, Mint, Daisy, Light Pink, Lime\n- Reviews: Great shirt. Quick turnaround. Daughter loves it | Great quality! Quick shipping! Great gift idea! | Good material and done really well. My friend loved it as it was her Christmas present from me. | Great Seller,  Shipped Fast.  Thank you | Item was as described and met my expectations. Thank you!\n", "output": "{\"label\": \"relevant\", \"reason\": \"Query does not specify any specific product type. Query requested product features include: swiftie is a Taylor Swift fan, query looks for any item a taylor swift fan would like. Product is t-shirt. Feature wise, image caption confirms that the shirt has the the lyrics to the song All Too Well printed in red on the front, and All Too Well is a song by Taylor Swift. Product matches perfectly to the intent of the query looking for any item a taylor swift fan would like, therefore label is relevant.\"}"}
{"input": "Query: bag of holding\n- Possible rewrites for this query: bag of holding keepsake blanket, bag of holding keepsake, bag of holding from the kingtide saga, bag of holding apollo x anime cafe, bag of holding keepsake box\n- Concepts in this query: tangibleItem:bag;fandom:bag of holding;\n\nProduct:\n- Title: Mystery Dice Blind Bags! Over 70 styles available! DND Dice Tabletop\n- Shop name: GamemastersGuildLLC\n- Product image caption: Three silver holographic bags with the text \"Gamemasters Guild\" printed on them. The bags are surrounded by a variety of colorful dice with different numbers and symbols printed on them.\n- Unigrams & bigrams from description: mystery, blind, bag, perfect, look, something, new, over, style, di, mystery blind, blind bag, bag perfect, something new, over style\n- Category: toys_and_games.games_and_puzzles.role_playing_games\n- Attributes: holiday:christmas\n- Tags: DND Dice, Table top dice, pathfinder, dungeons and dragons, polyhedral dice, Dice, blind bag, mystery dice, gift for dnd, dnd gifts, dnd dice set, rpg dice, d and d dice set\n- Custom options: Style: Mystery Bag!, Mystery Box Special!, Mystery Tin!, Mystery Metal!, Mystery Sharp Resin!\n- Reviews: The item had ok quality but a lot of really cool variety. | I bought my husband a mystery pack for Christmas and loved it so I thought I would treat us both to new dice and wow, so in love with them! | While I am very happy with my item, I am very disappointed it came two days later then it was scheduled to. | Cute little set of dice | arrived on time and my friends love them! recommend!\n", "output": "{\"label\": \"partial\", \"reason\": \"Query does not specify any specific product type. Query requested product features include: related to bag of holding, which is a magical item in Dungeons and Dragons or DnD. Product is mystery bags of dices. Feature wise, title confirms that the dices are from DnD. Product does not match with bag of holding specificly, but matches with the theme of DnD, therefore label is partial.\"}"}
{"input": "Query: gilmore girls\n- Possible rewrites for this query: Gilmore girls gifts, gilmore girls gifts, gilmore girls gift, gilmore girls fans\n- Concepts in this query: fandom:gilmore girls;\n\nProduct:\n- Title: Luke's Watercolor Painting Unframed Matte Poster Art Print\n- Shop name: GreetingsFromTherapy\n- Product image caption: A framed watercolor painting of a street scene with a yellow sign that reads \"Luke's\" hanging above a storefront. The street is lined with trees and the buildings are painted in muted tones of yellow and brown.\n- Unigrams & bigrams from description: nostalgic, watercolor, painting, use, digital, illustration, print, thick, matte, poster, paper, perfect, gift, nostalgic watercolor, watercolor painting, use digital, digital illustration, thick matte, matte poster, poster paper, perfect gift\n- Category: art_and_collectibles.prints.digital_prints\n- Attributes: orientation:vertical;primary color:yellow;secondary color:green\n- Tags: gilmore girls, gilmore girls fan, gilmore girls gift, lukes diner, gilmore girls art, lukes diner merch, lukes diner print, digital wall art, stars hollow art, stars hollow, lukes diner gift, gilmore girls print, wall art\n- Custom options: Size: 8″×10″, 5″×7″\n- Reviews: High quality, matched the description and looks great in my kitchen :) | Great print! Really enjoy the design | I was surprised at the quality of this print! | High quality artwork and found an amazing frame to go with it. | Very good quality, will make a great gift for my fiancé who loves Gilmore Girls.\n", "output": "{\"label\": \"relevant\", \"reason\": \"Query does not specify any specific product type. Query requested product features include: related to the Gilmore Girls TV show. Product is a painting. Feature wise, title and image caption confirm that the painting is about the Luke\\\\'s, and Luke\\u2019s Diner is from the TV show Gilmore Girls. Product matches perfect with query intent, therefore label is relevant.\"}"}
{"input": "Query: shagaf vanilla toffee\n- Possible rewrites for this query: unknown\n- Concepts in this query: unknown\n\nProduct:\n- Title: Bronze and Blaze Perfume -  Bronze amber, cognac barrels, red oak leaf, Perique tobacco, Opoponax, Soft suede, Creamy steamy vanilla coffee\n- Shop name: Alkemia\n- Product image caption: A painting of a woman with dark hair and a red dress. She is holding a bouquet of flowers in her hand. The background is a gold and red color.\n- Unigrams & bigrams from description: autumnal, bronze, amber, age, cognac, barrel, stave, red, oak, leave, perique, pipe, tobacco, raw, wool, ripe, pumpkin, opoponax, sweet, myrrh, soft, autumnal bronze, bronze amber, amber age\n- Category: bath_and_beauty.fragrances\n- Attributes: unknown\n- Tags: unknown\n- Custom options: Bottle Type: Alcohol Free Spray, Ultime - 5ml, Ultime - Rollerball, Extrait - Rollerball, Extrait - 5ml\n- Reviews: Boozy and dark, yet completely wearable scent. My husband chose this for himself, and he adores it. I'd absolutely steal it to wear on myself as well. 😆 | Yummy cognac and spices, more masculine than what I wear but it is perfection for a cool autumn day. | Fantastic fragrance, one of my new favorites! | Cognac and tobacco?! Yes please! The perfect fall day will be when you wear this perfume oil! | This is my all time forever eternal favorite fall scent. Tobacco warmth perfection.\n", "output": "{\"label\": \"partial\", \"reason\": \"Query requested product type is vanilla toffee fragrence. Query requested product features include: from brand Shagaf. Product is vanilla toffee fragrence, as shown by title and category. For brand Shagaf, product shop name is Alkemia which does not match with Shagaf. Product type matches, but product feature of brand does not match, therefore label is partial.\"}"}
{"input": "Query: caitlynminimalist\n- Possible rewrites for this query: caitlyn minimalist gifts, caitlyn minimalist Etsy, caitlyn minimalist gift, caitlyn minimalist jewelry, cailyn minimalist prints\n- Concepts in this query: fandom:caitlynminimalist;\n\nProduct:\n- Title: Personalized Name Necklace by CaitlynMinimalist • Gold Name Necklace with Box Chain • Perfect Gift for Her • Personalized Gift • NM81F91\n- Shop name: CaitlynMinimalist\n- Product image caption: A gold chain necklace with a cursive nameplate that reads \"Blakely\".\n- Unigrams & bigrams from description: b, c, m, e, k, l, delicate, soft, name, necklace, box, chain, lovely, adornment, x c, i n, m e, e n, n e, e c, c k, k l, c e, name necklace\n- Category: jewelry.necklaces.monogram_and_name_necklaces\n- Attributes: recipient:women;recipient:girls;chain style:box;holiday:christmas;occasion:birthday;can be personalized:yes;material multi:yellow gold;jewelry style:minimalist;jewelry theme:letters & words;material multi:rose gold;material multi:silver\n- Tags: GIFTS FOR HER, NAME NECKLACE, SILVER NAME NECKLACE, PERSONALIZED JEWELRY, MINIMALIST NECKLACE, DAINTY NAME NECKLACE, PERSONALIZED GIFT, CUSTOM NAME NECKLACE, CAITLYN MINIMALIST, GOLD NAME NECKLACE, BOX CHAIN, GIFTS FOR MOM, BEST HOLIDAY GIFTS\n- Custom options: LENGTH: 16 INCHES, 15 INCHES, 17 INCHES, 14 INCHES, 21 INCHES, 18 INCHES, 20 INCHES, 19 INCHES, 22 INCHES; FINISH: ROSE GOLD, STERLING SILVER, 18K GOLD\n- Reviews: I had to order another necklace because I sadly lost the first one. I had it for 3 years and wore it all the time without taking it off and it held up well and stayed in great condition. I love it! | I love it, this is my third customized name chain. I got it with my son's name. | Kate is very responsive when you need a follow up with your order. The quality is amazing! Definitely one of the best pieces I've ever received. | Purchased as a gift for a friend that just had a baby. The name necklace looks amazing & can't wait to give it to her! Would definitely recommend | I absolutely love getting stuff from this site.\n", "output": "{\"label\": \"relevant\", \"reason\": \"Query does not specify any specific product type. Query requested product features include: from brand caitlynminimalist which has a shop at Etsy. Product is a necklace as shown by title. For brand caitlynminimalist, product shop name confirms that it is from CaitlynMinimalist. Product perfectly matches with the query, therefore label is relevant.\"}"}
{"input": "Query: caitlynminimalist\n- Possible rewrites for this query: caitlyn minimalist gifts, caitlyn minimalist Etsy, caitlyn minimalist gift, caitlyn minimalist jewelry, cailyn minimalist prints\n- Concepts in this query: fandom:caitlynminimalist;\n\nProduct:\n- Title: Name Necklace Gold, Nameplate Necklace 14k Solid Gold, Custom Name Jewelry, Gold Filled Name, Mama Necklace, Personalized Name Jewelry, AU20\n- Shop name: Funufco\n- Product image caption: unknown\n- Unigrams & bigrams from description: perfect, personal, addition, wardrobe, beautiful, name, necklace, k, solid, gold, elegant, timeless, way, perfect personal, personal addition, beautiful name, name necklace, k solid, solid gold, timeless way\n- Category: jewelry.necklaces.monogram_and_name_necklaces\n- Attributes: sustainability:recycled metal;recycled:yes;chain style:cable;jewelry theme:letters & words;gold solidity:solid gold;gold solidity:gold filled;material multi:yellow gold;recipient:women;adjustable:yes;jewelry closure type:lobster claw;gold purity:14k;primary color:yellow;jewelry style:minimalist;number of necklace strands:1;material multi:silver;recipient:girls;can be personalized:yes;secondary color:gold\n- Tags: mama necklace, name necklace, Name Plate Necklace, gift for mom, necklace with name, gold name necklace, solid gold necklace, custom name necklace, script name necklace, name necklace gold, nameplate necklace, necklaces, personalized gift\n- Custom options: Finish: 14k Rose Gold Filled, 14k Solid Gold, 14k Gold Filled, 10k Solid Gold, Sterling Silver; Necklace length: 16\", 14\", 20\", 18\", Child 3-7 old year\n- Reviews: I purchased a necklace as a Christmas gift for my daughter and was so happy with what arrived that I went back to order one for myself.  The second time around did not disappoint.  I would definitely recommend this shop to anyone in the future. | So beautiful ! Definitely recommend | Love this necklace. Thank you so much. | Necklace is delicate, but looks exactly as advertised. Great value and I highly recommend. | Can't wait to gift these to my bridesmaids in July ♥️\n", "output": "{\"label\": \"partial\", \"reason\": \"Query does not specify any specific product type. Query requested product features include: from brand caitlynminimalist which has a shop at Etsy. Product is a custom name necklace. For brand caitlynminimalist, product shop name is Funufco which does not match CaitlynMinimalist. However, CaitlynMinimalist is a famous brand for jewelry and product is also a jewelry in similar style. While product does not match with query on brand, it is thematically related to the query, therefore label is partial.\"}"}
{"input": "Query: velari jewelry ring\n- Possible rewrites for this query: unknown\n- Concepts in this query: unknown\n\nProduct:\n- Title: Stainless Steel Fidget Spinning Ring | Anxiety Relief | Stress Relief Tool\n- Shop name: RylynHarper\n- Product image caption: Four different colored rings with a textured edge. The rings are silver, black, rose gold, and iridescent green.\n- Unigrams & bigrams from description: anxiety, stress, day, fidget, spin, ring, sleek, design, accessory, fidget spin, spin ring, sleek design\n- Category: jewelry.rings.statement_rings\n- Attributes: recipient:unisex kids;can be personalized:no;material multi:stainless steel;recipient:girls;recipient:unisex adults;recipient:women;recipient:men;spinner:yes\n- Tags: unknown\n- Custom options: Ring size: 7, 8, 6, 9, 5, 10; Band color: Black, Gold, Rainbow, Silver, Rose gold\n- Reviews: The ring is just as expected and arrived fast! | Very pretty and satisfying to spin | It's great! I love it. | Great!! Very happy with this item. | Arrived quickly, thank you very much.\n", "output": "{\"label\": \"partial\", \"reason\": \"Query requested product type is ring. Query requested product features include: from Velari Jewelry which is a shop on Etsy. Product is a fidge spinning ring. With regard to from the Velari Jewelry shop, product shop name is RylynHarper which does not match with Velari Jewelry. Product type match, product feature does not match, therefore label is partial.\"}"}
{"input": "Query: velari jewelry ring\n- Possible rewrites for this query: unknown\n- Concepts in this query: unknown\n\nProduct:\n- Title: Custom Neon Sign , Neon Signs , Neon sign bedroom , LED Neon Sign , Wedding sign , Neon light Sign, Home Decor , Wall Decor , Valentines day\n- Shop name: ManhattanNeons\n- Product image caption: A neon blue sign that says \"Luna\".\n- Unigrams & bigrams from description: unknown\n- Category: home_and_living.home_decor.wall_decor.wall_hangings.signs\n- Attributes: room:living room;material multi:acrylic;room:bar;room:bedroom;room:kids;room:office\n- Tags: unknown\n- Custom options: Acrylic Shape: Cut to shape, Cut to letter, Cut to square\n- Reviews: I absolutely love the custom sign I ordered for my granddaughter! I cannot wait to give it to her on her Birthday! Thank you! | Absolutely perfect and an absolute pleasure to work with! Can't wait to order my next one!!🩷🥰 | me and my boyfriend loved the sign! | An awesome sign and highly recommended | Came as described and Eoin was great to work with and very detailed about the personalization of the product.  Would recommend!\n", "output": "{\"label\": \"not_relevant\", \"reason\": \"Query requested product type is ring. Query requested product features include: from Velari Jewelry which is a shop on Etsy. Product is a neon sign. With regard to from the Velari Jewelry shop, product shop name is ManhattanNeons which does not match with Velari Jewelry. Product type does match, and product feature does not match, therefore label is not_relevant.\"}"}
{"input": "Query: rooster coffee mug\n- Possible rewrites for this query: rooster coffee mug gift, farm animal coffee mug, rooster mug gift, rooster coffee cup\n- Concepts in this query: tangibleItem:coffee mug;motif:rooster;\n\nProduct:\n- Title: Backyard Chickens, Tea Towel\n- Shop name: PartyOnPaperCo\n- Product image caption: unknown\n- Unigrams & bigrams from description: _x0000_twill machine, towel, cold, educational, tea towel, wash, educational tea, machine wash, ch tea, cold water, cotton, backyard, ch, water, tea, cotton twill, twill, kitchen, machine, kitchen ch_x0000_\n- Category: home_and_living.kitchen_and_dining.linens.kitchen_and_tea_towels\n- Attributes: holiday:christmas;material multi:cotton\n- Tags: chicken lover, present, educational gift, chicken gift, chicken lovers gift, chicken tea towel, rooster towel, backyard chickens, Mother's Day, types of chickens, farm gift, crazy chicken lady, breeds of chickens\n- Custom options: add on: tea towel + card, tea towel\n- Reviews: This is so cute and fun...a gift for my daughter! | I bought this a gift. The item met all my expectations. I would purchase other items from this shop. | Exactly as shown, shipped/arrived super quick. I love it! | The towel is fabulous.   Beautiful, deep set colors.  It is exactly as described.   We received it very quickly after ordering. | Beautiful! Great quality and vibrant colors. Gift for best friend's mom. She'll love it!\n", "output": "{\"label\": \"partial\", \"reason\": \"Query requested product type is coffee mug. Query requested product features include: has rooster motif. Product is tea towel. For the rooster motif, product has rooster motif because the tags contain term rooster towel. Product type does not match, but product feature matches, therefore label is partial.\"}"}
{"input": "Query: xxxl red dress\n- Possible rewrites for this query: unknown\n- Concepts in this query: unknown\n\nProduct:\n- Title: Linen dress, Womens Red Pleated Midi Linen Dress, Spring Long Linen Dress, Boat Neck Swing Linen Dress with Pockets, Handmade dress 3423#\n- Shop name: xiaolizi\n- Product image caption: A long-sleeved, red midi dress with a gathered skirt and a scoop neckline.\n- Unigrams & bigrams from description: thanks, briesoldo, wear, xiaoliz, red, linen, dress, midi, craft, soft, cotton, darker, shape, hue, featur, briesoldo wear, wear xiaoliz, red linen, linen dress, red midi, midi dress, dress craft, soft cotton, cotton linen\n- Category: clothing.womens_clothing.dresses\n- Attributes: neckline:boat;sleeve length:3/4 sleeve;clothing style:mod;dress style:skater & circle;skirt silhouette:a-line;pattern:solid;pockets:yes;leg/hem length:mid-calf\n- Tags: linen dress, midi dress, pleated dress, long dress, swing dress, red dress, spring summer dress, made to order, xiaolizi, boat neck dress, A Line dress, Long Linen dress, womens Linen dress\n- Custom options: Size: Custom size, XS, XL, S, L, M; Primary color: Leave a note, red\n- Reviews: The dress is gorgeous and fits perfectly! The material feels great. | This dress is absolutely beautiful. I was recommended to order a different size based on my measurements, and I'm glad I did. It fits very well and is very comfortable. | Very pretty, love the material! True to the size chart! | We got several dresses from this shop and my wife likes each one of them from B+ to A+ score so would recommend to try them. | I love this dress and the seller is amazing!\n", "output": "{\"label\": \"relevant\", \"reason\": \"Query requested product type is dress. Query requested product features include: has color red, is size xxxl which means extra large size. Product is dress. For color, title, tags, and description confirm that product has red color. For size, custom option contains custom size, which means the size of the product can be customized to fit any need, including a need for xxxl size. Product type match, and both features match between query and product, therefore label is relevant.\"}"}
{"input": "Query: handbag\n- Possible rewrites for this query: fashion handbag, chosen book bag, petite handbag, trendy handbag, unique handbag designs, assorted handbags to choose from, womens handbag\n- Concepts in this query: tangibleItem:handbag;\n\nProduct:\n- Title: 10 PNG Floral Handbag Clipart, Floral Purse, Floral Clutch, Digital Clipart, Printable Watercolor clipart, Digital download, Paper crafts\n- Shop name: NightingaleCraftery\n- Product image caption: A white leather handbag with a pink handle and strap. The bag is decorated with pink flowers and green leaves. The bag has a gold lock and keyhole.\n- Unigrams & bigrams from description: irresistible, worth, clipart, collection, image, good, value, money, bundle, variety, irresistible worth, clipart collection, good value, money clipart, clipart bundle\n- Category: craft_supplies_and_tools.canvas_and_surfaces.stencils_templates_and_transfers.clip_art\n- Attributes: craft type:kids' crafts;craft type:collage;craft type:card making & stationery;craft type:scrapbooking\n- Tags: digital crafting, clip art, digital clipart, clipart pack, scrapbook images, watercolor clipart, floral purse, woman handbag, handbag clipart, purse clipart, woman bag clipart, floral bag, digital planner\n- Custom options: unknown\n- Reviews: Ordered In error, conversation w/vendor funds returned. | Not exactly what I wanted or expected. Thought the vendor would be more understanding and I could trade and purchase something else. I ordered the wrong item. I know my fault but there you go. Also, I had problems. Downloading the in the beginning. | These are all very lovely images and will prove so useful for birthdays etc!  Love them! | Beautiful prints with great colours | A beautiful set of watercolor florals!\n", "output": "{\"label\": \"partial\", \"reason\": \"Query requested product type is handbag. Query does not request any specific feature around the product. Product is digital files for download. Feature wise, product has design of floral handbags, confirmed by title. Product type does not match, but product feature matches with handbag from query, therefore label is partial.\"}"}
{"input": "Query: william and mary style furniture\n- Possible rewrites for this query: unknown\n- Concepts in this query: unknown\n\nProduct:\n- Title: William & Mary University SVG, Tribe SVG, College, Athletics, Football, Ready For Cricut, Instant Download.\n- Shop name: AyfesGift\n- Product image caption: unknown\n- Unigrams & bigrams from description: ayfesgift, digital, file, bundle, svg, png, pdf, project, digital file, svg png, png pdf\n- Category: art_and_collectibles.drawing_and_illustration.digital\n- Attributes: unknown\n- Tags: william mary, tribe, university, college, athletics, football, basketball, baseball, svg, png, pdf\n- Custom options: unknown\n- Reviews: Download works great. Includes both retro and current Tribe logos.\n", "output": "{\"label\": \"not_relevant\", \"reason\": \"Query requested product type is furniture. Query requested product features include: has william and mary style, which is a design style from the early 18th century of furniture. Product is digital file for download. Feature wise, product has design related to the William and Mary University, which is a different concept from the william and mary style in the context of furniture. Product type does not match, and features do not match, therefore label is not_relevant.\"}"}
