{"input": "Query: dainty silver flower ring\n- Concepts in this query: not available\n\nProduct:\n- Title: Flower ring | .925 sterling silver | nature-inspired jewelry | minimalistic stacking ring | wedding jewelry | gift for her\n- Shop: 6daycreations2\n- Image: A hand wearing silver ring with a flower design and a thin band\n- Description: lovely, ring, feature, branch, finger, small, flower, perfect, lovely ring, ring feature, s finger, small flower", "output": "{\"label\": \"relevant\", \"reason\": \"Query requested product type is ring. Query requested product features include: dainty style, silver color and or material, flower motif. Product is ring. For dainty, title includes minimalist and image caption mentioning thin band confirms that product is dainty. For silver, product attributes match both material and color silver. For flower motif, title and description confirms that product has flower motif. Product type match, and all product features match, therefore label is relevant.\"}"}
{"input": "Query: personalized baby blanket\n- Concepts in this query: tangibleItem:baby blanket;customization:personalized;\n\nProduct:\n- Title: Personalized Baby Blanket, Soft Cotton Knit Baby Blanket, Custom Baby Name Blanket, Baby Shower Gift,Newborn Blanket, Keepsake Gift for Baby\n- Shop: BabyShop77\n- Image: A sage green knitted baby blanket with the name \"Oliver Henry\" embroidered in white. The text \"Ships Next Business Day\" is also visible in the image.\n- Description: baby, gift, blanket, personalize, soft, cotton, knit, shower, name, ba, baby gift, gift baby, baby blanket, blanket personalize, personalize baby, soft cotton, cotton knit, knit baby, blanket baby, baby shower, shower gift, baby name, name blanket, gift personalize", "output": "{\"label\": \"relevant\", \"reason\": \"Query requested product type is blanket. Query requested product features include: for babies, personalizable. Product is blanket. With regard to for babies, title and image caption confirm that product is for babies. For feature personalizable, title and custom options confirm that product is personalizable. Product type match, and both product features match, therefore label is relevant.\"}"}
{"input": "Query: 70s pants sewing pattern\n- Concepts in this query: not available\n\nProduct:\n- Title: Lenox Pajamas - PDF Sewing Pattern - Pajama Pants Pattern - Easy Pajama Pattern for Women + Teens - Sizes 0-18\n- Shop: StudioMSquared\n- Image: A person wearing a gray tank top and blue and white floral print pajama pants. The person is standing on a white bed with a blue pillow.\n- Description: pdf, sewing, pattern, finish, product, full, description, purchase, new, favorite, pair, comfy, lounge, pdf sewing, sewing pattern, finish product, product please, full description, new favorite, favorite pair, comfy lounge", "output": "{\"label\": \"partial\", \"reason\": \"Query requested product type is sewing pattern. Query requested product features include: pattern for pants, 70s style. Product is sewing pattern. With regard to pattern for pants, title, tags, and description confirm that the pattern is for pajama pants which is a specific type of pants. With regard to 70s, description mentioning that this is for every-day comfy lounge wear suggesting that it is not in 70s style. Product type match, but not all features match, therefore label is partial. \"}"}
{"input": "Query: 70s pants sewing pattern\n- Concepts in this query: not available\n\nProduct:\n- Title: Party! Disco Ball Hand Embroidery Pattern - PDF PATTERN ONLY\n- Shop: CristinMorganThread\n- Image: Embroidered disco ball pattern with embroidery floss in various colors including pink, orange, red, blue, and green. The embroidery hoop is on a white surface with glitter. The text \"PDF PATTERN ONLY!\" is in a black circle.\n- Description: party, time, own, sparkly, disco, ball, hoop, pdf, pattern, perfect, gift, collection, home, deco, party time, own sparkly, sparkly disco, disco ball, ball hoop, pdf pattern, pattern perfect, own collection, home deco", "output": "{\"label\": \"partial\", \"reason\": \"Query requested product type is sewing pattern. Query requested product features include: pattern for pants, 70s style. Product is hand embroidery pattern. With regard to pattern for pants, product is not a pattern for pants because it is a pattern for disco ball. With regard to 70s, disco balls are characteristic of the disco era in the 1970s, so product matches with this part of the query. Product type does not match, but one of the features thematically match, therefore label is partial. \"}"}
{"input": "Query: mid century modern furniture\n- Concepts in this query: tangibleItem:furniture;style:mid century modern;\n\nProduct:\n- Title: Same Hour Reading/Same Day Psychic Reading Psychic Predictions, General Reading, Psychic Reading, Spiritual Reading, Blind Intuitive Reading\n- Shop: TheMotherMoonCoven\n- Image: not available\n- Description: same, hour, day, blind, reading, psychic, prediction, general, desti, same hour, same day, blind reading, psychic prediction, psychic reading, reading general, general reading", "output": "{\"label\": \"not_relevant\", \"reason\": \"Query requested product type is furniture. Query requested product features include: mid century modern style. Product is psychic reading. Product is not a furniture, and it has nothing to do with the mid century modern style under the context of furniture. Product type does not match, and none of the features match, therefore label is not_relevant. \"}"}
{"input": "Query: advent calendars\n- Concepts in this query: tangibleItem:calendars;\n\nProduct:\n- Title: Charlie's Homemade Smoked Beef Jerky Bites  FREE  SHIPPING\n- Shop: CharliesWSBJ\n- Image: A close-up of a plate of small, dark red, meaty cubes. The cubes are arranged in a random pattern and appear to be cooked and glazed. The cubes are on a white paper towel.\n- Description: order, receive, business, day, ho, order receive, business day", "output": "{\"label\": \"not_relevant\", \"reason\": \"Query requested product type is advent calendars. Query does not request any specific feature around the product. Product is beef jerky. Product is not advent calendars. Product type does not match, and none of the features match, therefore label is not_relevant. \"}"}
{"input": "Query: jigglypuff\n- Concepts in this query: fandom:jigglypuff;\n\nProduct:\n- Title: Snorlax Watch Charger Base\n- Shop: not available\n- Image: not available\n- Description: not available", "output": "{\"label\": \"partial\", \"reason\": \"Query does not specify any specific product type. Query requested product features include: related to jigglypuff, which is a kind of pokemon. Product is a watch charger base. Feature wise, title confirms that product has a snorlax design, which is also a kind of pokemon. While product does not match the query, it is related to the pokemon theme of the query, therefore label is partial. \"}"}
{"input": "Query: derrick white\n- Concepts in this query: fandom:derrick white;\n\nProduct:\n- Title: Greatest Celtics Plays: Leatherette Coasters (Set of 4)\n- Shop: PlaybookProducts\n- Image: not available\n- Description: relive, great, moment, celtic, basketball, history, set, laser, etch, coaster, historic, play, great moment, celtic basketball, basketball history, laser etch, etch coaster, historic play", "output": "{\"label\": \"partial\", \"reason\": \"Query does not specify any specific product type. Query requested product features include: related to derrick white, who is a basketball player for the Boston Celtics. Product is a set of 4 coasters. Feature wise, description confirms that product has design related to Celtics basketball. While product does not match the query, it is related to the Celtics basketball theme of the query, therefore label is partial. \"}"}
{"input": "Query: swiftie\n- Concepts in this query: fandom:swiftie;\n\nProduct:\n- Title: All Too Well Shirt\n- Shop: SweatShirtUSCO\n- Image: A beige t-shirt with the lyrics to the song \"All Too Well\" printed in red on the front. The lyrics are in a small font and are arranged in a vertical column. The lyrics include the lines \"I walked through the door with you, The air was cold, but something about you made me feel like I was home again\" and \"You call me up again just to break me like a promise, so casually cruel in the name of being honest.\" \n- Description: \"\"", "output": "{\"label\": \"relevant\", \"reason\": \"Query does not specify any specific product type. Query requested product features include: swiftie is a Taylor Swift fan, query looks for any item a taylor swift fan would like. Product is t-shirt. Feature wise, image caption confirms that the shirt has the the lyrics to the song All Too Well printed in red on the front, and All Too Well is a song by Taylor Swift. Product matches perfectly to the intent of the query looking for any item a taylor swift fan would like, therefore label is relevant.\"}"}
{"input": "Query: bag of holding\n- Concepts in this query: tangibleItem:bag;fandom:bag of holding;\n\nProduct:\n- Title: Mystery Dice Blind Bags! Over 70 styles available! DND Dice Tabletop\n- Shop: GamemastersGuildLLC\n- Image: Three silver holographic bags with the text \"Gamemasters Guild\" printed on them. The bags are surrounded by a variety of colorful dice with different numbers and symbols printed on them.\n- Description: mystery, blind, bag, perfect, look, something, new, over, style, di, mystery blind, blind bag, bag perfect, something new, over style", "output": "{\"label\": \"partial\", \"reason\": \"Query does not specify any specific product type. Query requested product features include: related to bag of holding, which is a magical item in Dungeons and Dragons or DnD. Product is mystery bags of dices. Feature wise, title confirms that the dices are from DnD. Product does not match with bag of holding specificly, but matches with the theme of DnD, therefore label is partial.\"}"}
{"input": "Query: gilmore girls\n- Concepts in this query: fandom:gilmore girls;\n\nProduct:\n- Title: Luke's Watercolor Painting Unframed Matte Poster Art Print\n- Shop: GreetingsFromTherapy\n- Image: A framed watercolor painting of a street scene with a yellow sign that reads \"Luke's\" hanging above a storefront. The street is lined with trees and the buildings are painted in muted tones of yellow and brown.\n- Description: nostalgic, watercolor, painting, use, digital, illustration, print, thick, matte, poster, paper, perfect, gift, nostalgic watercolor, watercolor painting, use digital, digital illustration, thick matte, matte poster, poster paper, perfect gift", "output": "{\"label\": \"relevant\", \"reason\": \"Query does not specify any specific product type. Query requested product features include: related to the Gilmore Girls TV show. Product is a painting. Feature wise, title and image caption confirm that the painting is about the Luke\\\\'s, and Luke\\u2019s Diner is from the TV show Gilmore Girls. Product matches perfect with query intent, therefore label is relevant.\"}"}
{"input": "Query: shagaf vanilla toffee\n- Concepts in this query: not available\n\nProduct:\n- Title: Bronze and Blaze Perfume -  Bronze amber, cognac barrels, red oak leaf, Perique tobacco, Opoponax, Soft suede, Creamy steamy vanilla coffee\n- Shop: Alkemia\n- Image: A painting of a woman with dark hair and a red dress. She is holding a bouquet of flowers in her hand. The background is a gold and red color.\n- Description: autumnal, bronze, amber, age, cognac, barrel, stave, red, oak, leave, perique, pipe, tobacco, raw, wool, ripe, pumpkin, opoponax, sweet, myrrh, soft, autumnal bronze, bronze amber, amber age", "output": "{\"label\": \"partial\", \"reason\": \"Query requested product type is vanilla toffee fragrence. Query requested product features include: from brand Shagaf. Product is vanilla toffee fragrence, as shown by title. For brand Shagaf, product shop name is Alkemia which does not match with Shagaf. Product type matches, but product feature of brand does not match, therefore label is partial.\"}"}
{"input": "Query: caitlynminimalist\n- Concepts in this query: fandom:caitlynminimalist;\n\nProduct:\n- Title: Personalized Name Necklace by CaitlynMinimalist • Gold Name Necklace with Box Chain • Perfect Gift for Her • Personalized Gift • NM81F91\n- Shop: CaitlynMinimalist\n- Image: A gold chain necklace with a cursive nameplate that reads \"Blakely\".\n- Description: b, c, m, e, k, l, delicate, soft, name, necklace, box, chain, lovely, adornment, x c, i n, m e, e n, n e, e c, c k, k l, c e, name necklace", "output": "{\"label\": \"relevant\", \"reason\": \"Query does not specify any specific product type. Query requested product features include: from brand caitlynminimalist which has a shop at Etsy. Product is a necklace as shown by title. For brand caitlynminimalist, product shop name confirms that it is from CaitlynMinimalist. Product perfectly matches with the query, therefore label is relevant.\"}"}
{"input": "Query: caitlynminimalist\n- Concepts in this query: fandom:caitlynminimalist;\n\nProduct:\n- Title: Name Necklace Gold, Nameplate Necklace 14k Solid Gold, Custom Name Jewelry, Gold Filled Name, Mama Necklace, Personalized Name Jewelry, AU20\n- Shop: Funufco\n- Image: not available\n- Description: perfect, personal, addition, wardrobe, beautiful, name, necklace, k, solid, gold, elegant, timeless, way, perfect personal, personal addition, beautiful name, name necklace, k solid, solid gold, timeless way", "output": "{\"label\": \"partial\", \"reason\": \"Query does not specify any specific product type. Query requested product features include: from brand caitlynminimalist which has a shop at Etsy. Product is a custom name necklace. For brand caitlynminimalist, product shop name is Funufco which does not match CaitlynMinimalist. However, CaitlynMinimalist is a famous brand for jewelry and product is also a jewelry in similar style. While product does not match with query on brand, it is thematically related to the query, therefore label is partial.\"}"}
{"input": "Query: velari jewelry ring\n- Concepts in this query: not available\n\nProduct:\n- Title: Stainless Steel Fidget Spinning Ring | Anxiety Relief | Stress Relief Tool\n- Shop: RylynHarper\n- Image: Four different colored rings with a textured edge. The rings are silver, black, rose gold, and iridescent green.\n- Description: anxiety, stress, day, fidget, spin, ring, sleek, design, accessory, fidget spin, spin ring, sleek design", "output": "{\"label\": \"partial\", \"reason\": \"Query requested product type is ring. Query requested product features include: from Velari Jewelry which is a shop on Etsy. Product is a fidge spinning ring. With regard to from the Velari Jewelry shop, product shop name is RylynHarper which does not match with Velari Jewelry. Product type match, product feature does not match, therefore label is partial.\"}"}
{"input": "Query: velari jewelry ring\n- Concepts in this query: not available\n\nProduct:\n- Title: Custom Neon Sign , Neon Signs , Neon sign bedroom , LED Neon Sign , Wedding sign , Neon light Sign, Home Decor , Wall Decor , Valentines day\n- Shop: ManhattanNeons\n- Image: A neon blue sign that says \"Luna\".\n- Description: not available", "output": "{\"label\": \"not_relevant\", \"reason\": \"Query requested product type is ring. Query requested product features include: from Velari Jewelry which is a shop on Etsy. Product is a neon sign. With regard to from the Velari Jewelry shop, product shop name is ManhattanNeons which does not match with Velari Jewelry. Product type does match, and product feature does not match, therefore label is not_relevant.\"}"}
{"input": "Query: rooster coffee mug\n- Concepts in this query: tangibleItem:coffee mug;motif:rooster;\n\nProduct:\n- Title: Backyard Chickens, Tea Towel\n- Shop: PartyOnPaperCo\n- Image: not available\n- Description: _x0000_twill machine, towel, cold, educational, tea towel, wash, educational tea, machine wash, ch tea, cold water, cotton, backyard, ch, water, tea, cotton twill, twill, kitchen, machine, kitchen ch_x0000_", "output": "{\"label\": \"partial\", \"reason\": \"Query requested product type is coffee mug. Query requested product features include: has rooster motif. Product is tea towel. For the rooster motif, product has rooster motif because the description contain term rooster towel. Product type does not match, but product feature matches, therefore label is partial.\"}"}
{"input": "Query: xxxl red dress\n- Concepts in this query: not available\n\nProduct:\n- Title: Linen dress, Womens Red Pleated Midi Linen Dress, Spring Long Linen Dress, Boat Neck Swing Linen Dress with Pockets, Handmade dress 3423#\n- Shop: xiaolizi\n- Image: A long-sleeved, red midi dress with a gathered skirt and a scoop neckline.\n- Description: thanks, briesoldo, wear, xiaoliz, red, linen, dress, midi, craft, soft, cotton, darker, shape, hue, featur, briesoldo wear, wear xiaoliz, red linen, linen dress, red midi, midi dress, dress craft, soft cotton, cotton linen", "output": "{\"label\": \"relevant\", \"reason\": \"Query requested product type is dress. Query requested product features include: has color red, is size xxxl which means extra large size. Product is dress. For color, title and description confirm that product has red color. For size, custom option contains custom size, which means the size of the product can be customized to fit any need, including a need for xxxl size. Product type match, and both features match between query and product, therefore label is relevant.\"}"}
{"input": "Query: handbag\n- Concepts in this query: tangibleItem:handbag;\n\nProduct:\n- Title: 10 PNG Floral Handbag Clipart, Floral Purse, Floral Clutch, Digital Clipart, Printable Watercolor clipart, Digital download, Paper crafts\n- Shop: NightingaleCraftery\n- Image: A white leather handbag with a pink handle and strap. The bag is decorated with pink flowers and green leaves. The bag has a gold lock and keyhole.\n- Description: irresistible, worth, clipart, collection, image, good, value, money, bundle, variety, irresistible worth, clipart collection, good value, money clipart, clipart bundle", "output": "{\"label\": \"partial\", \"reason\": \"Query requested product type is handbag. Query does not request any specific feature around the product. Product is digital files for download. Feature wise, product has design of floral handbags, confirmed by title. Product type does not match, but product feature matches with handbag from query, therefore label is partial.\"}"}
{"input": "Query: william and mary style furniture\n- Concepts in this query: not available\n\nProduct:\n- Title: William & Mary University SVG, Tribe SVG, College, Athletics, Football, Ready For Cricut, Instant Download.\n- Shop: AyfesGift\n- Image: not available\n- Description: ayfesgift, digital, file, bundle, svg, png, pdf, project, digital file, svg png, png pdf", "output": "{\"label\": \"not_relevant\", \"reason\": \"Query requested product type is furniture. Query requested product features include: has william and mary style, which is a design style from the early 18th century of furniture. Product is digital file for download. Feature wise, product has design related to the William and Mary University, which is a different concept from the william and mary style in the context of furniture. Product type does not match, and features do not match, therefore label is not_relevant.\"}"}
